Autodesk.Revit.Exceptions.ModificationForbiddenException
The exception that is thrown by the undo transaction framework when a modification operation is not allowed.
Remarks:  See also: Autodesk::Revit::DB::Element::IsModifiable and Autodesk::Revit::DB::Document::IsModifiable.